[  
    {  
        "id": 1,  
        "headline": "Melting middle truffles", 
        "text": "Get these made and in the freezer up to a month ahead, then simply pull them out when you’re ready", 
        "longtext": ["Make the middles first. Heat the Dulce de Leche in a pan for 1 min until warmed and runny, then stir in the chopped dark chocolate and leave to melt. Stir until smooth. Cover a dinner plate with cling film, oil the cling film well, then tip the mix onto it. Cool, then freeze for 2 hrs or until very firm.", "Put the milk chocolate into a bowl. Bring the cream to the boil in another pan, then pour it over the chocolate. Leave for 2 mins, then add the vanilla and stir until smooth. Cool, then chill until set.", "Peel the caramel from the cling film, then snip into thumbnail-size pieces; wet kitchen scissors work best. Spread cocoa powder over a large baking tray. Take a heaped tsp of the truffle mix then, with cocoa-dusted hands, poke in a caramel chunk. Squash the mix around the caramel to seal, then roll into a ball. Put onto the tray, then shake to coat in the cocoa. Repeat with the rest of the mix, then freeze, or chill if making less than 3 days ahead."]
    },  
    {  
        "id": 2,  
        "headline": "Roast turkey breast wrapped in bacon",  
        "text": "It’s a total cheat, but looks great on a plate, is so delicious and, like many others have said, makes the best sandwiches afterwards!",  
        "longtext": ["Heat a drizzle of oil in a frying pan, and use a little more to grease a 900g loaf tin. Put the onion in the pan and cook gently for 10-15 mins until caramelised. Tip into a large bowl and set aside to cool. Line the loaf tin with a double strip of foil, leaving plenty overhanging either end (you can use this as a handle to remove the parcel once cooked).", "Stretch each piece of bacon a little with the back of your knife. Arrange the rashers so the base of the tin is covered with overlapping bacon and the rashers come neatly up the sides in a single layer, overhanging generously. Sprinkle the breadcrumbs on top of the bacon.", "Once the onion has cooled, add the sausagemeat and sage to the bowl. Mix everything together, then pack half the mixture into the tin. Spread over about a third of the cranberry sauce.", "Cut each turkey breast steak into three strips. Layer roughly half the turkey on top of the stuffing mix, filling any gaps like a jigsaw, but keeping the turkey in one thick layer, then season. Spread over a little more cranberry sauce, then top with the remaining stuffing, cranberry sauce and turkey in the same way, making sure there are no gaps between the layers. The parcel should be full to the top when you’re finished. Fold over the overhanging bacon and wrap the tin in foil. Can now be chilled for up to 2 days.", "Heat oven to 180C/160C fan/gas 4. Put the tin on a baking tray and cook for 1 hr 30 mins. Remove the tin from the oven and leave to cool for 10 mins. Carefully lift the parcel out of the tin, using the foil handles. Roll the parcel over onto a baking tray. Return to the oven for a further 15-20 mins until the outside is crisp and browning. Test the internal temperature with a thermometer, if you have one – it should read 75C when it’s ready. Or insert a metal skewer into the centre of the parcel and check it is piping hot. Cover loosely with foil and leave to rest for at least 15 mins before serving. Top with the reserved sage leaves, then slice. Leftovers will keep in the fridge for 2 days."] 
    },  
    {  
        "id": 3,  
        "headline": "Gingerbread man",  
        "text": "I also had the same dough problem/experience and I had to add milk to fix its consistency and make it rollable and cuttable. More than anything though, this is simply not a tasty recipe.",  
        "longtext": ["Heat oven to 200C/180C fan/gas 6. Line 2 baking sheets with baking parchment. Melt butter, sugar and syrup in a pan. Mix flour, soda, spices and a pinch of salt in a bowl. Stir in the butter mix and chopped ginger to make a stiff-ish dough.", "Wait until cool enough to handle, then roll out dough to about 5mm thick. Stamp out gingerbread men, re-rolling and pressing the trimmings back together and rolling again. Lift onto baking sheets. Bake for 12 mins until golden. Cool 10 mins on the sheets, then lift onto cooling racks.", "To decorate, mix icing sugar with a few drops of water until thick and smooth. Halve then slice cherries thinly to make smiles, and cut ginger into small squares. Spoon icing into a food bag, snip off the tiniest bit from one corner, then squeeze eyes and buttons, and a tiny smile onto 1 man at a time. Stick on a cherry smile and ginger buttons. Repeat; leave to set. Will keep up to 1 week in an airtight tin."] 
    },
    {  
        "id": 4,  
        "headline": "Ham & cheese croquetas",  
        "text": "These tasty, deep-fried bites can be made ahead and frozen, perfect for no-fuss entertaining as part of a party buffet spread",  
        "longtext": ["To make the croquetas, melt the butter in a medium saucepan and gently fry the onion for 3 mins or until lightly coloured. Stir in the flour and cook for 30 secs. Gradually add the milk, stirring constantly, and cook over a low heat for 5 mins until thick and glossy. Stir in the ham, cheese, mustard and cream, and season to taste. Cook for 1 min more until the cheese melts, stirring constantly.", "Pour into a bowl and cover the surface with cling film to stop a skin forming. Leave to cool, then chill for 4 hrs or overnight - the mixture needs to be very stiff to form the croquetas. Take heaped teaspoons of the mixture and, with wet hands, roll into 24 small oval shapes and put on a tray. Beat the eggs in a shallow bowl, put the flour on a plate and half of the breadcrumbs in a bowl.", "Roll each of the croquetas lightly in flour, then in egg before coating in breadcrumbs. Place on a baking tray lined with baking parchment. Use the remaining breadcrumbs to top up the bowl halfway through the coating process. Chill for 30 mins (or to freeze, see tip, below left).", "Meanwhile, make the tomato chilli jam. Put all the ingredients in a large saucepan and bring to a gentle simmer. Cover loosely with a lit and cook for 50 mins - 1 hr, stirring occasionally, until thick and glossy. Leave to cool before serving.", "Fill a large saucepan one-third full with the sunflower oil and heat to 180C (or heat the oil in an electric deep-fat fryer). Do not overheat and do not leave hot oil unattended. Using a metal slotted spoon, lower 6 croquets into the oil and cook for 1.5 mins or until golden brown. Transfer to a baking tray lined with kitchen paper to absorb excess oil, and continue cooking the rest. Serve with the chilli jam for dipping."] 
    },
    {  
        "id": 5,  
        "headline": "Fruitcake with cheese & apples",  
        "text": "The classic combination of apples and cheese is given a lift with thin slices of sweet fruitcake - a great festive party canapé or buffet treat",  
        "longtext": ["Cut the fruitcakes into thin pieces and top each with a slice of Lancashire cheese and a piece of apple, tossed in a little lemon juice if not eating immediately. Can be made up to 1 hr ahead."] 
    }
]  